Revit 2026 API
UIApplication.CreateRibbonPanel(String) Method
 Create a new RibbonPanel on the Add-Ins tab.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public virtual RibbonPanel CreateRibbonPanel(
	string panelName
)
Public Overridable Function CreateRibbonPanel (
	panelName As String
) As RibbonPanel
public:
virtual RibbonPanel^ CreateRibbonPanel(
	String^ panelName
)
abstract CreateRibbonPanel :
        panelName : string -> RibbonPanel
override CreateRibbonPanel :
        panelName : string -> RibbonPanel
Parameters
panelName String
The name of the panel to be created.
Return Value
RibbonPanel
Exceptions
Exception | Condition
ArgumentNullException | panelName is null.
ArgumentException | panelName is Empty.
InvalidOperationException | If more than 100 panels were created.
Remarks
 This method will create a custom panel appending to the Revit AddIns tab. This method is not supported in Macros.
See Also
Reference
UIApplication Class
CreateRibbonPanel Overload
Autodesk.Revit.UI Namespace